$("#gov-list").bootstrapTable({
    // url:"",
    idField:'id',
    pagination:true,
    data:[
        {id:1,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:2,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:3,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:4,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:5,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:6,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:7,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:8,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:9,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:10,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
        {id:11,title:'国际自由贸易港城工程（绿地集团重庆置业有限公司）',222:'绿地集团',33:'房产建设',44:'111',5:"2015-3-4",6:'1',7:'1',8:'2',9:'3',10:'1',11:'1'},
    ],
    columns:[[
        {field:'id',checkbox:true,align:'center'},
        {field:'title',title:'标题',align:"center"},
        {field:"222",title:"发布者",align:'center'},
        {field:'44',title:'所属栏目',align:'center'},
        {field:'5',title:'点击数',align:'center'},
        {field:'6',title:"发布日期",align:'center'},
        {field:"7",title:'审核状态',align:'center',formatter:function(value,row,index){
            if(value){
                return "已审核"
            }
            else{
                return "未审核"
            }
        }},
        {field:'8',title:"推荐",align:'center',formatter:function(value,row,index){
            return "已推荐"
        }},
        {field:'9',title:"置顶",align:'center',formatter:function(value,row,index){
            return "置顶"
        }},
        {field:'10',title:'编辑/删除',align:'center',formatter:function(value,row,index){
            return '编辑 &nbsp; 删除'
        }},
        {field:'11',title:'推送',align:'center',formatter:function(value,row,index){
            return "推送"
        }}
    ]]
})